package com.caco3.orca.scheduleapi;


import com.google.gson.Gson;

import org.junit.BeforeClass;
import org.junit.Test;

import java.util.List;

import static junit.framework.Assert.assertEquals;
import static junit.framework.Assert.assertTrue;

public class GroupsResponseParseTest {
    private static final Gson gson = new Gson();

    private static final String VALID_GROUPS_JSON
            = "[" +
            "\"БМС-11\"," +
            "\"БМС-21\"," +
            "\"В-51\"," +
            "\"В-52\"," +
            "\"ВМ-11\"," +
            "\"ВМ-12\"," +
            "\"ВМ-21\"," +
            "\"ВМ-22\"," +
            "\"ВТ-11\"," +
            "\"ВТ-12\"," +
            "\"ВТ-21\"," +
            "\"ВТ-22\"," +
            "\"Д-11\"," +
            "\"Д-12\"," +
            "\"Д-21\"," +
            "\"Д-22\"," +
            "\"Д-23\"," +
            "\"Д-31\"," +
            "\"Д-32\"," +
            "\"Д-33\"," +
            "\"Д-41\"," +
            "\"Д-42\"," +
            "\"Д-43\"," +
            "\"ИБ-11\"," +
            "\"ИБ-21\"," +
            "\"ИГД-21\"," +
            "\"ИПОВС-11\"," +
            "\"ИПОВС-12\"," +
            "\"ИПОВС-21\"," +
            "\"ИПОВС-22\"," +
            "\"ИТС-11\"," +
            "\"ИТС-12\"," +
            "\"ИТС-13\"," +
            "\"ИТС-13А\"," +
            "\"ИТС-14\"," +
            "\"ИТС-15\"," +
            "\"ИТС-21\"," +
            "\"ИТС-22\"," +
            "\"ИТС-23\"," +
            "\"ИТС-24\"," +
            "\"ИТС-25\"," +
            "\"ИТС-31\"," +
            "\"ИТС-32\"," +
            "\"ИТС-33\"," +
            "\"ИТС-34\"," +
            "\"ИТС-35\"," +
            "\"ИТС-41\"," +
            "\"ИТС-42\"," +
            "\"ИТС-43\"," +
            "\"ИТС-44\"," +
            "\"ИТС-45\"," +
            "\"ИЭМС-11\"," +
            "\"ИЭМС-12\"," +
            "\"ИЭМС-21\"," +
            "\"ИЭМС-22\"," +
            "\"КИТИС-11\"," +
            "\"КИТИС-21\"," +
            "\"КФН-11\"," +
            "\"КФН-21\"," +
            "\"МИУП-11\"," +
            "\"МИУП-21\"," +
            "\"МП-10\"," +
            "\"МП-11\"," +
            "\"МП-12\"," +
            "\"МП-12А\"," +
            "\"МП-13\"," +
            "\"МП-14\"," +
            "\"МП-15\"," +
            "\"МП-15А\"," +
            "\"МП-16\"," +
            "\"МП-17\"," +
            "\"МП-18\"," +
            "\"МП-19\"," +
            "\"МП-19А\"," +
            "\"МП-20\"," +
            "\"МП-21\"," +
            "\"МП-22\"," +
            "\"МП-23\"," +
            "\"МП-24\"," +
            "\"МП-25\"," +
            "\"МП-26\"," +
            "\"МП-27\"," +
            "\"МП-28\"," +
            "\"МП-29\"," +
            "\"МП-30\"," +
            "\"МП-31\"," +
            "\"МП-32\"," +
            "\"МП-32А\"," +
            "\"МП-33\"," +
            "\"МП-34\"," +
            "\"МП-35\"," +
            "\"МП-36\"," +
            "\"МП-37\"," +
            "\"МП-38\"," +
            "\"МП-39\"," +
            "\"МП-40\"," +
            "\"МП-41\"," +
            "\"МП-42\"," +
            "\"МП-43\"," +
            "\"МП-44\"," +
            "\"МП-45\"," +
            "\"МП-46\"," +
            "\"МП-47\"," +
            "\"МП-48\"," +
            "\"МП-49\"," +
            "\"МПВ-11\"," +
            "\"МПВ-12\"," +
            "\"МПВ-21\"," +
            "\"МПВ-31\"," +
            "\"МПВ-32\"," +
            "\"МПВ-41\"," +
            "\"МПВ-42\"," +
            "\"МРТУС-11\"," +
            "\"МРТУС-21\"," +
            "\"МФЭ-11\"," +
            "\"МФЭ-12\"," +
            "\"МФЭ-13\"," +
            "\"МФЭ-14\"," +
            "\"МФЭ-21\"," +
            "\"МФЭ-22\"," +
            "\"МЭ-11\"," +
            "\"МЭ-12\"," +
            "\"МЭ-21\"," +
            "\"МЭ-22\"," +
            "\"ОИГ-11\"," +
            "\"ОИГ-21\"," +
            "\"ОФ-11\"," +
            "\"ОФ-21\"," +
            "\"П-11\"," +
            "\"П-12\"," +
            "\"П-13\"," +
            "\"П-21\"," +
            "\"П-22\"," +
            "\"П-23\"," +
            "\"П-31\"," +
            "\"П-32\"," +
            "\"П-33\"," +
            "\"П-41\"," +
            "\"П-42\"," +
            "\"П-43\"," +
            "\"ПКИМС-11\"," +
            "\"ПКИМС-14\"," +
            "\"ПКИМС-21\"," +
            "\"ПКИМС-24\"," +
            "\"ПЭ-11\"," +
            "\"ПЭ-21\"," +
            "\"САУК-11\"," +
            "\"САУК-21\"," +
            "\"ССК-11\"," +
            "\"ССК-21\"," +
            "\"ТКС-12\"," +
            "\"ТКС-22\"," +
            "\"ТКС-23\"," +
            "\"УДАЛ-ЭУ-47\"," +
            "\"ЭИМ-11\"," +
            "\"ЭИМ-21\"," +
            "\"ЭКТ-11\"," +
            "\"ЭКТ-12\"," +
            "\"ЭКТ-13\"," +
            "\"ЭКТ-14\"," +
            "\"ЭКТ-15\"," +
            "\"ЭКТ-16\"," +
            "\"ЭКТ-17\"," +
            "\"ЭКТ-18\"," +
            "\"ЭКТ-21\"," +
            "\"ЭКТ-22\"," +
            "\"ЭКТ-23\"," +
            "\"ЭКТ-24\"," +
            "\"ЭКТ-25\"," +
            "\"ЭКТ-26\"," +
            "\"ЭКТ-27\"," +
            "\"ЭКТ-28\"," +
            "\"ЭКТ-31\"," +
            "\"ЭКТ-32\"," +
            "\"ЭКТ-33\"," +
            "\"ЭКТ-34\"," +
            "\"ЭКТ-35\"," +
            "\"ЭКТ-36\"," +
            "\"ЭКТ-37\"," +
            "\"ЭКТ-38\"," +
            "\"ЭКТ-41\"," +
            "\"ЭКТ-42\"," +
            "\"ЭКТ-43\"," +
            "\"ЭКТ-44\"," +
            "\"ЭКТ-45\"," +
            "\"ЭКТ-46\"," +
            "\"ЭКТ-47\"," +
            "\"ЭУ-11\"," +
            "\"ЭУ-12\"," +
            "\"ЭУ-21\"," +
            "\"ЭУ-22\"," +
            "\"ЭУ-23\"," +
            "\"ЭУ-24\"," +
            "\"ЭУ-25\"," +
            "\"ЭУ-31\"," +
            "\"ЭУ-32\"," +
            "\"ЭУ-33\"," +
            "\"ЭУ-34\"," +
            "\"ЭУ-35\"," +
            "\"ЭУ-36\"," +
            "\"ЭУ-41\"," +
            "\"ЭУ-42\"," +
            "\"ЭУ-43\"," +
            "\"ЭУ-44\"," +
            "\"ЭУ-45\"," +
            "\"ЭУ-46\"," +
            "\"ЭУ-47\"," +
            "\"ЭУВ-11\"," +
            "\"ЭУВ-22\"," +
            "\"ЭУВ-32\"," +
            "\"ЭУВ-42\"," +
            "\"ЭУВ-43\"" +
            "]";

    private static List<String> groups;

    @BeforeClass
    @SuppressWarnings("unchecked")
    public static void parseGroupsJson(){
        groups = gson.fromJson(VALID_GROUPS_JSON, List.class);
    }

    @Test
    public void thereIs212Groups(){
        assertEquals(212, groups.size());
    }

    @Test
    public void thereIsMp11Group(){
        assertTrue(groups.contains("МП-11"));
    }


    @Test
    public void thereIsEct46Group(){
        assertTrue(groups.contains("ЭКТ-46"));
    }
}
